[/Script/GameProjectGeneration.TemplateProjectDefs]

Categories=Games


LocalizedDisplayNames=(Language="en",Text="Top Down")
LocalizedDescriptions=(Language="en",Text="This template features a playable character and a top-down camera perspective at a greater distance. The player can control the character by clicking or touching on a destination, or following the cursor if input is held. You can select a genre-specific starting point from the Variants drop-down. The C++ version includes code and content for all variants.")

LocalizedDisplayNames=(Language="ko",Text="탑 뷰")
LocalizedDescriptions=(Language="ko",Text="이 템플릿은 플레이 가능한 캐릭터와 더 먼 거리에서 내려다보는 탑다운 카메라 시점을 제공합니다. 플레이어는 목적지를 클릭하거나 터치하여 캐릭터를 제어할 수 있으며, 커서를 길게 누르면 커서를 따라 움직일 수 있습니다. 베리언트 드롭다운에서 장르에 맞게 시작할 옵션을 선택할 수 있습니다. C++ 버전에는 모든 배리언트에 대한 코드와 콘텐츠가 포함되어 있습니다.")

LocalizedDisplayNames=(Language="ja",Text="トップ ダウン")
LocalizedDescriptions=(Language="ja",Text="このテンプレートには、プレイアブル キャラクターと、より遠距離からのトップダウン カメラの視点が含まれています。プレイヤーは、目的地をクリックまたはタッチするか、入力が保持されている場合はカーソルを追うことでキャラクターを操作できます。[バリアント] ドロップダウンからジャンル固有の開始点を選択できます。C++ バージョンには、すべてのバリアントのコードとコンテンツが含まれています")

LocalizedDisplayNames=(Language="zh-Hans",Text="俯视角模板")
LocalizedDescriptions=(Language="zh-Hans",Text="此模板模板包含一个可操控的角色以及一个位于较远位置的俯视视角。玩家可以通过点击或触摸目标位置来控制角色，或者使其在持续按下输入键的情况下跟随光标移动。你可以从“变体（Variants）”下拉菜单中选择特定游戏类型的起始点。C++版本包含了所有变体的代码和内容。")

; This project uses a thumbnail as the project icon
bThumbnailAsIcon=true

ClassTypes=GameMode, Character, CameraComponent, SpringArmComponent, PlayerController
AssetTypes=Animation Sequence, Skeletal Mesh, Animation Blueprint, Skeleton

FoldersToIgnore=Binaries
FoldersToIgnore=Build
FoldersToIgnore=Intermediate
FoldersToIgnore=Saved
FoldersToIgnore=Media

FilesToIgnore="%TEMPLATENAME%.uproject"
FilesToIgnore="%TEMPLATENAME%.png"
FilesToIgnore="Config/TemplateDefs.ini"
FilesToIgnore="Config/config.ini"
FilesToIgnore="%TEMPLATENAME%.opensdf"
FilesToIgnore="%TEMPLATENAME%.sdf"
FilesToIgnore="%TEMPLATENAME%.v11.suo"
FilesToIgnore="%TEMPLATENAME%.v12.suo"
FilesToIgnore="%TEMPLATENAME%.sln"
FilesToIgnore="Manifest.json"
FilesToIgnore="contents.txt"


FolderRenames=(From="Source/%TEMPLATENAME%",To="Source/%PROJECTNAME%")
FolderRenames=(From="Source/%TEMPLATENAME%Editor",To="Source/%PROJECTNAME%Editor")

FilenameReplacements=(Extensions=("cpp","h","ini","cs"),From="%TEMPLATENAME_UPPERCASE%",To="%PROJECTNAME_UPPERCASE%",bCaseSensitive=true)
FilenameReplacements=(Extensions=("cpp","h","ini","cs"),From="%TEMPLATENAME_LOWERCASE%",To="%PROJECTNAME_LOWERCASE%",bCaseSensitive=true)
FilenameReplacements=(Extensions=("cpp","h","ini","cs"),From="%TEMPLATENAME%",To="%PROJECTNAME%",bCaseSensitive=false)

ReplacementsInFiles=(Extensions=("cpp","h","ini","cs"),From="%TEMPLATENAME_UPPERCASE%",To="%PROJECTNAME_UPPERCASE%",bCaseSensitive=true)
ReplacementsInFiles=(Extensions=("cpp","h","ini","cs"),From="%TEMPLATENAME_LOWERCASE%",To="%PROJECTNAME_LOWERCASE%",bCaseSensitive=true)
ReplacementsInFiles=(Extensions=("cpp","h","ini","cs"),From="%TEMPLATENAME%",To="%PROJECTNAME%",bCaseSensitive=false)SharedContentPacks=(MountName="TopDown",DetailLevels=("Standard"))
SharedContentPacks=(MountName="LevelPrototyping",DetailLevels=("High"))
SharedContentPacks=(MountName="Characters",DetailLevels=("High"))
SharedContentPacks=(MountName="Cursor",DetailLevels=("Standard"))
EditDetailLevelPreference="High"
